Repository: abeek1/61439-3_2024
Catalog: tm/EVS-EN_61439-1_2021/EVS-EN_61439-1_2021_10_Design verification  _10 KONSTRUKTSIOONIOMADUSTE KONTROLL.tmx
Source language: en
Languages: et

source: 10.9.4 Testing of enclosures made of insulating material For assemblies with enclosures made of insulating material, an additional dielectric test shall be carried out by applying an AC test voltage between a metal foil laid on the outside of the enclosure over openings and joints, and the interconnected live and exposed-conductive-parts within the assembly located next to the openings and joints.
et: 10.9.4 Isoleermaterjalist ümbriste katsetamine Isoleermaterjalist ümbristega koostete puhul tuleb sooritada dielektriliste omaduste lisakatsetus, rakendades selleks ümbrise välispinnale avade ja liitekohtade kohale asetatud metall-lehe ning koostesiseste avade ja liitekohtade läheduses paiknevate ning omavahel kokku ühendatud pingestatud ja pingealdiste juhtivate osade vahele teimi-vahelduvpinge.

source: For this additional test, the test voltage shall be equal to 1,5 times the values indicated in Table 8.
et: Selle lisakatsetuse puhul peab teimipinge olema tabelis 8 esitatud väärtustest 1,5 korda kõrgem.

source: 10.9.5 External door or cover mounted operating handles of insulating material In the case of handles made of or covered by insulating material, a power-frequency withstand voltage test shall be carried out by applying a test voltage equal to 1,5 times the test voltage indicated in Table 8 between the live parts and a metal foil wrapped round the whole surface of the representative handle.
et: 10.9.5 Välisele uksele või kattele monteeritud isoleermaterjalist talitluskäepidemed Isoleermaterjalist valmistatud või sellega kaetud käepidemete puhul tuleb võrgusageduslik taluvuspingekatsetus sooritada tabelis 8 esitatud 1,5-kordse teimipinge rakendamisega pingestatud osade ja kogu pinna ulatuses käepideme ümber mähitud esindusliku metallfooliumi vahele.

source: During this test, the exposed-conductive-parts shall not be earthed or connected to any other circuit.
et: Selle katsetuse ajal ei tohi pingealtid juhtivad osad olla maandatud ega ühendatud mõne teise ahelaga.

source: 10.9.6 Testing of conductors and hazardous live parts covered by insulating material to provide protection against electric shock Conductors and hazardous live parts covered by insulating material in direct contact with the conductor so as to provide protection against electric shock, excluding those previously verified to their own product standard (e.g. cables), shall be subjected to an additional dielectric test.
et: 10.9.6 Kaitseks elektrilöögi eest ette nähtud, isoleermaterjaliga kaetud juhtide ja ohtlike pingestatud osade katsetamine Juhiga otseses kontaktis oleva isoleermaterjaliga selliselt kaetud juhid ja ohtlikud pingestatud osad, et need tagaksid kaitse elektrilöögi eest, väljaarvatult need, mis on varem kontrollitud vastavuse kohta nende endi tootestandarditega (nt kaablid), tuleb allutada dielektrilisele lisakatsetusele.

source: This test shall be carried out by applying an AC test voltage between a metal foil laid on the outside of the conductor insulation including openings and joints in the insulation, and the interconnected conductive parts within the insulation.
et: See katsetus tuleb sooritada vahelduv-teimipinge rakendamise teel juhi isolatsiooni välispinnale, sealhulgas avadele ja isolatsiooni liitekohtadele asetatud metallfooliumi ja isolatsiooni all paiknevate kokku ühendatud juhtivate osade vahele.

source: 10.10 Temperature-rise 10.10.1 General It shall be verified that the temperature-rise limits specified in 9.2 for the different parts of the assembly or assembly system will not be exceeded.
et: 10.10 Ületemperatuur 10.10.1 Üldnõuded Tuleb kontrollida, et kooste või koostesüsteemi eri osade ületemperatuur ei ületaks jaotises 9.2 sätestatud piirväärtusi.

source: Verification shall be made with one or more of the following methods (see Annex L for guidance): a) testing (10.10.2);
et: Kontroll tuleb sooritada ühe või mitme alljärgneva meetodiga (juhendumiseks vt lisa L): a) katsetamine (jaotis 10.10.2),

source: b) comparison with a reference design (10.10.3);
et: b) võrdlemine etalonkonstruktsiooniga (jaotis 10.10.3),

source: c) assessment (calculation) (10.10.4).
et: c) hindamine (või arvutamine) (jaotis 10.10.4).

source: In assemblies rated for frequencies above 60 Hz verification of temperature-rise by test (10.10.2) or by derivation from a similar design tested at the same intended frequency (10.10.3) is always required.
et: Koostete puhul, mille tunnussagedus on üle 60 Hz, tuleb alati kontrollida kas ületemperatuurikatsetusega (jaotis 10.10.2) või tuletamise teel samalaadse konstruktsiooni järgi, mida on katsetatud samal etteantud sagedusel (jaotis 10.10.3).

source: The current-carrying capacity of the circuits to be verified is determined by;
et: Kontrollitavate ahelate kestvalt lubatav vool on määratud

source: • the group rated current of a main circuit Ing (see 5.3.3); or
et: • peaahela rühmtunnusvooluga Ing (vt jaotis 5.3.3) või

source: • the rated current of the main circuit Inc (see 5.3.2) and the RDF (see 5.4).
et: • peaahela tunnusvooluga Inc (vt jaotis 5.3.2) ja tunnus-samaaegsusteguriga (vt jaotis 5.4).

source: NOTE In addition to Ing, Inc can be stated to allow assessment of the current-carrying capacity in lightly loaded sections, see 5.3.2.
et: MÄRKUS Peale voolude Ing ja Inc võidakse sätestada, et lubatakse hindamist kergelt koormatud sektsioonide kestvalt lubatava voolu järgi; vt jaotis 5.3.2.

source: For assemblies incorporating power factor correction banks, verification of temperature-rise shall meet the additional requirements of IEC 61921:2017.
et: Koostete puhul, mis sisaldavad võimsusteguri parandamise kondensaatorpatareisid, peab ületemperatuuri kontroll täitma standardi IEC 61921:2017 lisanõudeid.

source: 10.10.2 Verification by testing 10.10.2.1 General Verification through testing consists of the following.
et: 10.10.2 Kontroll katsetamise teel 10.10.2.1 Üldnõuded Kontroll katsetamise teel sisaldab järgmisi toiminguid.

source: a) If the assembly system to be verified comprises a number of variants, the most onerous arrangement(s) for the assembly system shall be selected according to 10.10.2.2.
et: a) Kui kontrollitaval koostesüsteemil on mitu eri varianti, tuleb vastavalt jaotisele 10.10.2.2 valida koostesüsteemi kõige raskem(ad) korraldusviis(id).

source: b) The assembly variant(s) selected shall be verified by one of the following methods (see Annex L):
et: b) Kooste varianti (või variante) tuleb kontrollida ühega järgmistest meetoditest (vt lisa L):

source: 1) considering individual functional units, the main and distribution busbars and the assembly collectively according to 10.10.2.3.5;
et: 1) arvestades individuaal-funktsionaalühikuid, kogumis- ja jaotuslatte ning koostet kollektiivselt vastavalt jaotisele 10.10.2.3.5;

source: 2) considering individual functional units separately, and the complete assembly including the main and distribution busbars according to 10.10.2.3.6;
et: 2) arvestades individuaal-funktsionaalühikuid eraldi ning tervikkoostet koos kogumis- ja jaotuslattidega vastavalt jaotisele 10.10.2.3.6;

source: 3) considering individual functional units and the main and distribution busbars separately as well as the complete assembly according to 10.10.2.3.7.
et: 3) arvestades individuaal-funktsionaalühikuid, kogumis- ja jaotuslatte eraldi ning ka tervikkoostet vastavalt jaotisele 10.10.2.3.7.

source: c) When the assembly variant(s) tested are the most onerous variants of an assembly system, then the test results can be used to establish the ratings of similar variants without further testing.
et: c) Kui katsetatav koostevariant (või katsetatavad variandid) on koostesüsteemi kõige keerukamad, võib nende katsetustulemusi ilma edaspidiste katsetusteta kasutada muude taoliste variantide tunnusandmete kehtestamiseks.

source: Comparison rules for such derivations are given in 10.10.3.
et: Niisuguse tuletamise võrdlusreeglid on esitatud jaotises 10.10.3.

source: 10.10.2.2 Selection of the representative arrangement
et: 10.10.2.2 Esindusliku korraldusviisi valik

source: 10.10.2.2.1 General
et: 10.10.2.2.1 Üldnõuded

source: The test shall be made on one or more representative arrangements loaded with one or more representative load combinations chosen to determine with reasonable accuracy the maximum temperature-rise under normal operating and installation conditions.
et: Katsetus tuleb sooritada ühe või mitme esindusliku korraldusviisiga, mis on koormatud ühe või mitme esindusliku koormuskombinatsiooniga ja valitud selliselt, et saavutada mõistliku täpsusega suurim ületemperatuur normaalsetes talitlus- ja paigaldusoludes.

source: The selection of the representative arrangements to be tested is given in 10.10.2.2.2 and 10.10.2.2.3 and is the responsibility of the original manufacturer.
et: Esindusliku korraldusviisi valiku eest vastutab esmatootja ja see on esitatud jaotistes 10.10.2.2.2 ja 10.10.2.2.3.

source: The original manufacturer shall take into consideration in the selection for testing the configurations to be derived from the tested arrangements according to 10.10.3.
et: Esmatootja peab katsetuste valikul arvestama katsetatud korraldusviisidest tuletatavaid konfiguratsioone vastavalt jaotisele 10.10.3.

source: 10.10.2.2.2 Busbars
et: 10.10.2.2.2 Kogumislatid Kogumislattide süsteem sisaldab üht või mitut ristkülikulise ristlõikega juhti, mille variandid erinevad üksteisest üksnes ühe või mitme järgmise mõõtme vähendamise poolest:

source: For busbar systems consisting of single or multiple rectangular sections of conductor, where the variants differ only in the reduction of one or more of; – height,
et: — kõrgus,

source: – thickness,
et: — paksus,

source: – quantity of bars per conductor, and have the same;
et: — lattide arv ühe juhi kohta ning on ühe ja sama

source: – geometric arrangement of bars,
et: — lattide geomeetrilise kujundusega,

source: – centre line spacing of conductors,
et: — juhtide keskjoonte vahekaugusega,

source: – enclosure, and
et: — ümbrisega ja

source: – busbar compartment (if any),
et: — lattide lahtriga (kui see on olemas).

source: the busbars with the greatest cross-sectional area shall be selected as the representative arrangement as a minimum for the test.
et: Katsetuseks tuleb valida vähemalt esindusliku korraldusviisi suurima ristlõikega kogumislatid.

source: For ratings of smaller busbar size variants or other materials, see 10.10.3.3.
et: Tunnusandmeid lattide väiksema ristlõike või muu materjali korral vt jaotis 10.10.3.3.

source: 10.10.2.2.3 Functional units
et: 10.10.2.2.3 Funktsionaalühikud

source: a) Selection of comparable functional unit groups
et: a) Funktsionaalühikute võrreldavate rühmade valik

source: Functional units intended to be used at different rated currents can be considered to have a similar thermal behaviour and form a comparable range of units if they fulfil the following conditions:
et: Eri tunnusvooludel kasutamiseks ette nähtud funktsionaalühikuid võib arvestada, nagu eviksid need ühesuguseid soojuslikke omadusi ning et need moodustavad võrreldavate ühikute piirkonna, kui need täidavad järgmisi tingimusi:

source: 1) the function and basic wiring diagram of the main circuit is the same (e.g. incoming unit, reversing starter, cable feeder);
et: 1) funktsioon ja peaahela põhiühendusskeem (nt sisendühik, reversiivkäiviti, kaabliväljund) on ühesugused;

source: 2) the devices are of the same frame size and belong to the same series;
et: 2) seadised on ühesuguse raamsuurusega ning kuuluvad ühte ja samasse sarja;

source: 3) the mounting structure is of the same type;
et: 3) seadiste monteerimisviis on ühesugust liiki;

source: 4) the mutual arrangement of the devices is the same;
et: 4) seadiste vastastikune korraldusviis on ühesugune;

source: 5) the type and arrangement of conductors is the same;
et: 5) juhtide liik ja korraldusviis on ühesugune;

source: 6) the cross-section of the main circuit conductors within a functional unit shall have a rating at least equal to that of the lowest rated device in the circuit.
et: 6) funktsionaalühikutes paiknevate peaahelajuhtide ristlõiked peavad vastama vähemalt ahela vähima seadise tunnusandmetele.

source: Selection of cables shall be as tested or in accordance with IEC 60364-5-5:2009.
et: Juhtmed ja kaablid tuleb valida katsetuste põhjal või vastavalt standardile IEC 60364-5-52:2009.

source: Examples on how to adapt this document for conditions inside an assembly are given in Table H.1 and Table H.2.
et: Näited selle kohta, kuidas seda dokumenti kohaldada koostesisestele oludele, on esitatud tabelites H.1 ja H.2.

source: The cross-section of bars shall be as tested or as given in Annex K.
et: Lattide ristlõige peab olema sama nagu katsetustel või nagu esitatud lisas K.

source: b) Selection of a critical variant out of each comparable group as a specimen for test
et: b) Kriitilise variandi valik katsetusnäidisena igast võrreldavast rühmast

source: The maximum possible current rating for each variant of functional unit is established.
et: Määratakse kindlaks funktsionaalühikute kõigi variantide enimalt võimalik tunnusvool.

source: For functional units containing only one device, this is the rated current of the device.
et: Funktsionaalühikute puhul, mis sisaldavad ainult üht seadist, on see seadise tunnusvool.

source: For functional units with several devices, it is that of the device with the lowest rated current.
et: Mitme seadisega funktsionaalühikute puhul on see vähima tunnusvooluga seadise tunnusvool.

source: For each functional unit, the power loss is calculated at the maximum possible current using the data given by the device manufacturer for each device together with the power losses of the associated conductors.
et: Iga funktsionaalühiku jaoks arvutatakse võimsuskadu suurimal võimalikul voolul, kasutades seadise tootja esitatud andmeid iga seadise jaoks koos juurdekuuluvate juhtide võimsuskadudega.

source: For functional units with currents up to and including 630 A, the critical unit in each range is the functional unit with the highest total power loss.
et: Funktsionaalühikute puhul vooluga mitte üle 630 A on iga piirkonna kriitiline ühik suurima summaarse võimsuskaoga ühik.

source: For functional units with currents above 630 A, the critical unit in each range is that which has the highest rated current.
et: Funktsionaalühikute puhul vooluga üle 630 A on iga piirkonna kriitiline ühik suurima tunnusvooluga ühik.

source: This ensures that additional thermal effects relating to eddy currents and current displacement are taken into consideration.
et: See tagab, et pöörisvooludest ja pinnanähtusest tingitud soojuslikud lisanähtused on arvesse võetud.

source: The critical functional unit shall at least be tested: – inside the smallest compartment (if any) which is intended for this functional unit; and – with the worst variant of internal separation (if any) with respect to size of ventilation openings; and – with the enclosure with the highest installed power loss per volume; and – with the worst variant of ventilation of the enclosure with respect to the kind of ventilation (natural or forced convection) and size of ventilation openings.
et: Kriitilist funktsionaalühikut tuleb katsetada vähemalt — selle funktsionaalühiku jaoks ette nähtud vähimas lahtris (kui see on olemas) ja — sisemise eralduse (kui see on olemas) halvima variandi korral, arvestades ventilatsiooniavade suurust, ja — ümbrisega, millel on suurim paigaldatud võimsuskadu mahuühiku kohta, ja — ümbrise ventilatsiooni halvima variandi korral, arvestades ventilatsiooniviisi (loomulikku või sundventilatsiooni) ja ventilatsiooniavade suurust.

source: If the functional unit can be arranged in different orientations (horizontal, vertical), then the most onerous arrangement shall be tested.
et: Kui funktsionaalühikute korraldusviis võib olla mitmesuguse orientatsiooniga (rõhtne või püstne), tuleb katsetada kõige rängemat korraldusviisi.

source: Additional tests may be made at the discretion of the original manufacturer for less critical arrangements and variants of functional units, if any.
et: Esmatootja äranägemisel võib sooritada lisakatsetusi ka funktsionaalühikute vähem kriitiliste korraldusviiside ja variantide korral (kui neid on).

source: 10.10.2.3 Methods of test 10.10.2.3.1 General In 10.10.2.3.5 to 10.10.2.3.7, three methods of testing are given, which differ in the number of tests needed and in the range of applicability of the test results.
et: 10.10.2.3 Katsetusmeetodid 10.10.2.3.1 Üldnõuded Jaotistes 10.10.2.3.5 kuni 10.10.2.3.7 on esitatud kolm katsetusmeetodit, mis erinevad üksteisest vajalike katsete arvu ja katsetustulemuste rakendatavuse ulatuse poolest.

source: 10.10.2.3.5 provides a means of testing a complete assembly where the group rated current Ing is the test result.
et: Jaotis 10.10.2.3.5 käsitleb täieliku kooste katsetamisviise, mille katsetamistulemus on rühmtunnusvool Ing.

source: 10.10.2.3.6 provides a means of testing an assembly where additionally the rated current Inc of the outgoing circuits is determined with fewer tests than specified in 10.10.2.3.7.
et: Jaotis 10.10.2.3.6 käsitleb kooste katsetamisviise, milles peale selle määratakse väljuvate ahelate tunnusvool Inc vähema arvu katsetustega, kui see on sätestatud jaotises 10.10.2.3.7.

source: An explanation is provided in Annex L.
et: Selgitus on esitatud lisas L.

source: The temperature-rise test on the individual circuits shall be made with the type of current for which they are intended, and at the design frequency.
et: Üksikahelate ületemperatuurikatsetus tuleb sooritada sama liiki vooluga, millele need ahelad on ette nähtud, ja projektiga ettenähtud sagedusel.

source: Any convenient value of the test voltage may be used to produce the desired current.
et: Voolu mingi soovitava väärtuse saamiseks võib kasutada vastuvõetavaid katsetuspinge väärtusi.

source: Current consuming items such as, electronic components, coils of relays, contactors, releases, etc. shall be supplied with their rated operational voltages.
et: Voolutarviteid, nagu näiteks elektronkomponente, releemähiseid, kontaktoreid, vabasteid jne, tuleb toita nende tunnus-talitluspingel.

source: For assemblies with active cooling, the cooling equipment shall be operational, as in normal service.
et: Aktiivjahutusega koostete puhul peavad jahutusseadmed olema talitluses nagu normaalkäidu ajal.

source: The assembly shall be mounted as in normal use, with all covers including bottom cover plates, etc. in place.
et: Kooste tuleb kohale paigutada nagu normaalkasutuses, kusjuures kõik katted, sealhulgas põhjakatteplaadid jne, on paigas.

source: If the assembly includes fuses, it shall be fitted for the test with fuse-links as specified by the manufacturer.
et: Kui kooste sisaldab sulavkaitsmeid, tuleb katsetusel kasutada tootja sätestatud sulareid.

source: Details of the fuse-links used for the test, i.e. the manufacturer's name and reference, the rated current, the power loss of the fuse-link, and the breaking capacity, shall be given in the test report.
et: Katsetustel kasutatavate sularite üksikandmed, s.o tootja nimi ja andmed, tunnusvool, sulari võimsuskadu ja lahutusvõime, tuleb esitada katsetusaruandes.

source: The type test with the specified fuse-links shall be deemed to cover the use of any other fuse-link having a power loss, at the conventional thermal current of the combination unit, not exceeding the power loss of the fuse-link used for the test.
et: Tüübikatsetust sätestatud sulariga tuleb pidada vajalikuks, et arvestada mingi muu sulari kasutamist, mille võimsuskadu kombineeritud ühiku soojuslikult tavapärasel voolul ei ole suurem kui katsetusel kasutatud sulari võimsuskadu.

source: The size and the disposition of external conductors used for the test shall be stated in the test report.
et: Katsetusel kasutatavate välisjuhtide mõõtmed ja paigutus tuleb esitada katsetusaruandes.

source: The test shall be carried out for a time sufficient for the temperature-rise to reach a constant value.
et: Katsetus tuleb sooritada aja jooksul, mis piisab, et ületemperatuur jõuaks püsiväärtuseni.

source: In practice, this condition is reached when the variation at all measured points (including the ambient air temperature) does not exceed 1 K/h.
et: Praktikas on see tingimus täidetud, kui kõigi mõõtepunktide mõõteandmete ajalised muutused (sealhulgas ümbritseva õhu temperatuur) ei ole suuremad kui 1 K/h.

source: To shorten the test, if the devices allow it, the current may be increased during the first part of the test, with it being reduced to the specified test current afterwards.
et: Kui seadised seda võimaldavad, võib katsetusaja lühendamiseks katsetuste algetapil voolu suurendada ja seda hiljem vähendada kuni katsetusvoolu sätestatud väärtuseni.

source: When a control electro-magnet is energized during the test, the temperature is measured when thermal equilibrium is reached in both the main circuit and the control electro-magnet.
et: Kui katsetuste ajal pingestatakse juhtimis-elektromagnet, mõõdetakse temperatuur pärast soojusliku tasakaalu saabumist nii peaahelas kui ka juhtimis-elektromagnetis.

source: The average value of the actual incoming test currents shall be between 100 % and 103 % of the intended value.
et: Tegelike sisend-katsetusvoolude keskmine väärtus peab olema 100 % ja 103 % vahel ettenähtud väärtusest.

source: Each phase shall be within ±5 % of the intended value.
et: Kõigi faasivoolude ettenähtud väärtuste tolerants peab olema piirides ±5 %.

source: Tests on an individual section of the assembly are acceptable.
et: Kooste iseseisvate sektsioonide katsetused on vastuvõetavad.

source: To make the test representative, the external surfaces at which additional sections may be connected shall be thermally insulated with a covering to prevent any undue cooling.
et: Et katsetus oleks esinduslik, peavad välispinnad, mille külge võivad olla ühendatud lisasektsioonid, olema katete abil soojuslikult isoleeritud, et vältida igasugust ülemäärast jahutust.

source: When the performance of a single functional unit in one compartment is being tested as part of a complete assembly (or part of an assembly) as required by 10.10.2.3.7 d) taking into account the influence of other functional units in their own compartments, these other functional units can be replaced by heating resistors if the rating of each does not exceed 630 A and their rating is not to be verified with this test.
et: Kui katsetatakse üksiku funktsionaalühiku toimivust kogu kooste (või kooste osa) ühes sektsioonis, nagu see on nõutud jaotise 10.10.2.3.7 punktis d, võttes arvesse teiste, nende omades sektsioonides paiknevate funktsionaalühikute toimet, võib neid teisi funktsionaalühikuid asendada küttetakistitega, kui nende tunnusvool ei ole üle 630 A ja nende tunnusandmeid selle katsetusega ei kontrollita.

source: In assemblies where there is a possibility that additional auxiliary circuits or devices may be incorporated, heating resistors shall simulate the power dissipation of these additional items.
et: Koostete puhul, millega võidakse liita lisa-abiahelaid või -seadmeid, tuleb nendes lisaühikutes eralduva soojuse imiteerimiseks kasutada küttetakisteid.
